change diagram to mermaid
